if __name__ == '__main__':
    #7. 集合
    #7.1 基本格式：集合名 = {元素1,元素2,元素3..}
    #注意：
    #s1 = {}      #定义空字典
    #s1 = set()   #定义空集合

    #7.2集合具有无序性（集合无序的实现方式涉及hash表）
    s1 = {'a','b','c','d','e','f','g','h','i','j'}
    print(s1)   #每次运行结果不一样
    s2 = {1,2,3,4,5,6}
    print(s2)    #数字每次运行结果一样

    #7.3 集合具有唯一性，可以自动去重
    s3 = {1,2,3,3,4,5}
    print(s3)  #{1,2,3,4,5}

    #7.4 集合的常见操作
    #7.4.1 添加元素
    #add(): 添加的是一个整体
    s41 = {1,2,3,4,5,6}
    print('原集合：',s41)  # 原集合：{1,2,3,4,5,6}
    s41.add(7)
    print('现集合：', s41) # 现集合：{1,2,3,4,5,6,7}
    #s41.add(5,6)#报错--一次只能添加一个整体
    s41.add((8,9))
    print('现集合：', s41) # 现集合：{1,2,3,4,5,6,7,(8,9)}

    #update():把传入的元素（可迭代）拆分，一个个放入集合中
    s411 = {1,2,3,4}
    print('原集合：', s411)  # 原集合：{1,2,3,4}
    s411.update('56')
    print('添加后：', s411)  # 添加后：{1,2,3,4,'5','6'}
    s411.update([78])
    print('添加后：', s411)  # 添加后：{1,2,3,4,'5','6',7,8}

    #7.4.2 删除元素
    #remove():选择删除的元素，如果集合中有就删除，没有就会报错
    #pop():数字集合删除第一个，字符集合默认删除hash表排序后的第一个元素
    #discard():选择要删除的元素，有就会删除，没有则不会发生任何改变，即不会进行任何操作
    s42 = {1,2,3,4}
    s42.remove(3)  #{1,2,4}
    #s42.remove(5)  #报错
    s422 ={'a','b','c','d'}
    print('原集合：', s422)
    s422.pop()
    print('删除后：', s422)
    s4222 = {1, 2, 3, 4}
    print('原集合：', s4222)  # 原集合：{1,2,3,4}
    s4222.discard(3)
    print('删除后：', s4222)  # 删除后：{1,2,4}
    s4222.discard(7)
    print('删除后：', s4222)  # 删除后：{1,2,4}


    #7.5 交集与并集
    #交集 &  共有的部分
    #并集 |   所有的都在一起，重复的不算
    s5 = {1,2,3,4}
    s51 = {3,4,5,6}
    s52 = {5,6,7,8}
    print(s5 & s51)  # {3,4}
    print(s5 & s52)  #set()--没有的部分返回空集合
    print(s5 | s51)  #{1,2,3,4,5,6}
    print(s5 | s52)  #{1,2,3,4,5,6,7,8}
    print(s5 ^ s51)
    print(s5 ^ s52)
    print(s5 - s51)
    print(s5 - s52)



    #eg:
    # 集合是个KEY，存储一些不重复的元素
    a = {'a', 'b', 'c'}

    b = {
        'a': 1,
        'b': 2,
        'c': 3
    }
    print(type(a))

    t = 'd' in a
    print(t)

    x = 'a' in b
    print(x)

    l = [1, 2, 3, 2, 4, 5, 2]
    s1 = set(l)
    print(s1, type(s1), list(s1))

    s = {1, 2, 3, 4}

    s.add(5)
    print(s)

    s.remove(5)
    print(s)

    # 集合元素无序
    b = '12345'
    s2 = set(b)
    print(s2)
    s3 = {1, 2, 3, 4}
    s4 = {3, 4, 5, 6}
    print(s3 & s4)
    print(s3 | s4)
    print(s3 ^ s4)
    print(s3 - s4)
